//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <This File's Name>
//
// Description:	
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_J37_USB_PORT0_PROMPT                    #language eng "Rear  Panel (J37)  USB Port0"
                                                    #language zh-chs "后面板 (J37) USB 端口0"
#string STR_J37_USB_PORT0_PROMPT_HELP               #language eng "Enable or Disable Rear Panel (J37) USB2.0 And USB3.0 Port0 (CPU: 0 Die: 0 Port :0)"
                                                    #language zh-chs "启用或者禁用后面板 (J37)端口0的 USB2.0和USB3.0 (CPU: 0 Die: 0 Port :0) "
#string STR_J37_USB_PORT1_PROMPT                    #language eng "Rear  Panel (J37)  USB Port1"
                                                    #language zh-chs "后面板 (J37) USB 端口1"
#string STR_J37_USB_PORT1_PROMPT_HELP               #language eng "Enable or Disable Rear Panel (J37) USB2.0 And USB3.0 Port1 (CPU: 0 Die: 0 Port :1)"
                                                    #language zh-chs "启用或者禁用后面板 (J37)端口1的 USB2.0和USB3.0 (CPU: 0 Die: 0 Port :1)"
                                                    
#string STR_J52_USB_PORT_PROMPT                     #language eng "TypeA (J52)  USB Port"
                                                    #language zh-chs "TypeA (J52) USB 端口"
#string STR_J52_USB_PORT_PROMPT_HELP                #language eng "Enable or Disable TypeA (J52) USB3.0 Port (CPU: 0 Die: 1 Port :0)"
                                                    #language zh-chs "启用或者禁用TypeA (J52) USB3.0 端口(CPU: 0 Die: 1 Port :0)"
                                                    
#string STR_J56_USB_PORT_PROMPT                     #language eng "TypeA (J56)  USB Port"
                                                    #language zh-chs "TypeA (J56) USB 端口"
#string STR_J56_USB_PORT_PROMPT_HELP                #language eng "Enable or Disable TypeA (J56) USB3.0 Port (CPU: 0 Die: 1 Port :1)"
                                                    #language zh-chs "启用或者禁用TypeA (J56) USB3.0 端口(CPU: 0 Die: 1 Port :1)"
                                                    
//#string STR_BMC_USB_PORT_PROMPT                     #language eng "BMC  USB Port"
//#string STR_BMC_USB_PORT_PROMPT_HELP                #language eng "Enable or Disable BMC USB2.0 Port (CPU: 0 Die: 1 Port :1)"

#string STR_J104_USB_PORT0_PROMPT                   #language eng "Front Panel (J104) USB Port0"
                                                    #language zh-chs "前面板 (J104) USB 端口0"
#string STR_J104_USB_PORT0_PROMPT_HELP              #language eng "Enable or Disable Front Panel (J104) USB2.0 Port0 (CPU: 0 Die: 1 Port :0),if it was been disabled,it also will disable BMC USB port."
                                                    #language zh-chs "启用或者禁用前面板 (J104)端口0的 USB2.0 (CPU: 0 Die: 1 Port :0) ,如果这个Port被禁用,将会导致BMC USB端口也会被禁用"
#string STR_J104_USB_PORT1_PROMPT                   #language eng "Front Panel (J104) USB Port1"
                                                    #language zh-chs "前面板 (J104) USB 端口1"
#string STR_J104_USB_PORT1_PROMPT_HELP              #language eng "Enable or Disable Front Panel (J104) USB2.0 Port1 (CPU: 1 Die: 1 Port :0)"
                                                    #language zh-chs "启用或者禁用前面板 (J104)端口1的 USB2.0 (CPU: 1 Die: 1 Port :0) "

#string STR_J53_USB_PORT0_PROMPT                    #language eng "Front Panel (J53)  USB Port0"
                                                    #language zh-chs "前面板 (J53) USB 端口0"
#string STR_J53_USB_PORT0_PROMPT_HELP               #language eng "Enable or Disable Front Panel (J53) USB2.0 And USB3.0 Port0 (CPU: 1 Die: 0 Port :0)"
                                                    #language zh-chs "启用或者禁用前面板 (J53)端口0的 USB2.0和USB3.0 (CPU: 1 Die: 0 Port :0) "
#string STR_J53_USB_PORT1_PROMPT                    #language eng "Front Panel (J53)  USB Port1"
                                                    #language zh-chs "前面板 (J53) USB 端口1"
#string STR_J53_USB_PORT1_PROMPT_HELP               #language eng "Enable or Disable Front Panel (J53) USB2.0 And USB3.0 Port1 (CPU: 1 Die: 0 Port :1)"
                                                    #language zh-chs "启用或者禁用前面板 (J53)端口0的 USB2.0和USB3.0 (CPU: 1 Die: 0 Port :1) "

#string STR_XHCI_PORT_ENABLED                       #language eng "Enabled"
                                                    #language zh-chs "启用"
#string STR_XHCI_PORT_DISABLED                      #language eng "Disabled"
                                                    #language zh-chs "禁用"
#string STR_XHCI_PORT_FORM                          #language eng "USB Port Configuration"
                                                    #language zh-chs "USB端口配置"
#string STR_XHCI_PORT_HELP                          #language eng "Enable or Disable USB Port. Note: The USB2.0 Port0 (first USB2 port) must not be disabled if any USB2 or SuperSpeed ports are operational."
                                                    #language zh-chs "启用或禁用USB端口。注意：如果有其他的USB2.0或高速的端口在运行时，USB2.0 Port0(第一个USB 2端口)不能禁用"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************